# вказуємо на основі якого іміджа ми будемо робити докерфайл. Оскільки наш проект написаний на node js тоді ми шукаємо імідж node на докерхабі
# Вказуємо версію, в даному випадку - "latest"
FROM node:latest
 
#  Вказуємо хто підтримує цей репозиторій
MAINTAINER shizgara
 
#  Вказуємо робочу дерикторію, тобто в якій папці в середині цього іміджа ми будемо працювати
WORKDIR /var/www

# Тут ми вказуємо що все(знаком ".",тобто крапкою) що знаходиться в тій самій папці де і файл dockerfile потрібно скопіювати в дану паку(/var/www) даного іміджа
COPY . /var/www
 
#  За допомогою команди Run ми виконуємо  "npm install", тобто встановлюємо node modules
RUN npm install
 
 
ENTRYPOINT ["npm", "start"]